//---------------------------------------------------------------------------
//! @file   NetWorkManager_Server.h
//! @brief  サーバーネットワークマネージャー
//---------------------------------------------------------------------------
#pragma once
#include "NetWorkManagerBase.h"

//---------------------------------------------------------------------
//! @class NetWorkManager_Server
//! @brief サーバー側のネットワーク管理クラス
//---------------------------------------------------------------------
class NetWorkManager_Server :public NetWorkManagerBase
{


};
