//---------------------------------------------------------------------------
//! @file   NetWorkManager_Client.h
//! @brief  クライアントネットワークマネージャー
//---------------------------------------------------------------------------
#pragma once
#include "NetWorkManagerBase.h"
//---------------------------------------------------------------------
//! @class NetWorkManager_Client
//! @brief クライアント側のネットワーク管理クラス
//---------------------------------------------------------------------
class NetWorkManager_Client :public NetWorkManagerBase
{

};
