//---------------------------------------------------------------------------
//! @file   FileWatcher.h
//! @brief  ファイル変更監視クラスの定義。ファイルの変更を監視し、コールバックで通知する。
//! @author 岩野 健太郎
//---------------------------------------------------------------------------

#pragma once

//===========================================================================
//! ファイル変更監視
//===========================================================================
class FileWatcher
{
public:
    //----------------------------------------------------
    // @brief 初期化。
    // @param  [in]    path    監視対象のディレクトリパス。
    // @param  [in]    callback    ファイル変更通知のコールバック関数。
    //----------------------------------------------------
    bool initialize(const wchar_t* path, std::function<void(const wchar_t*)> callback);

    //----------------------------------------------------
    // @brief 更新。
    // @note メインループで呼ぶ必要がある。
    //----------------------------------------------------
    void update();

    //----------------------------------------------------
    // @brief コンストラクタ。
    //----------------------------------------------------
    FileWatcher() = default;

    //----------------------------------------------------
    // @brief デストラクタ。
    //----------------------------------------------------
    virtual ~FileWatcher();

private:
    //----------------------------------------------------
    // @brief ファイル監視を開始。
    //----------------------------------------------------
    bool start();

private:
    HANDLE                              finish_event_     = INVALID_HANDLE_VALUE;    //< @brief 非同期IO完了通知イベント。 
    HANDLE                              handle_directory_ = INVALID_HANDLE_VALUE;    //< @brief 監視先ディレクトリハンドル。 
    std::vector<u8>                     buffer_;                                     //< @brief ファイルリスト受信用バッファ。 
    OVERLAPPED                          overlapped_ = {};                            //< @brief 非同期IO。 
    std::function<void(const wchar_t*)> callback_;                                   //< @brief ファイル変更時のコールバック関数。 
    std::wstring                        full_path_;                                  //< @brief 監視中のフルパス。 
};
